THow-M/STM32_CAN_DVCS_Project/Firmware/ECU3_Sensor_Unit/User/main.c
#include "stm32f10x.h"                  // Device header
#include "System_Config.h"
#include "ecu3_main.h"
#include "Timer.h"
#include "Delay.h"
#include "LED.h"
#include "Serial.h"
#include "MyCAN.h"
#include "MPU6050.h"
#include "Ultrasonic.h"
#include "Voltage.h"
#include <stdio.h>
#include <math.h>
#include <string.h>

// 全局变量
System_State system_state = SYS_IDLE;
volatile uint32_t system_uptime = 0;
uint8_t error_code = ERROR_NONE;
uint8_t can_connected = 0;
static uint8_t diagnostic_requested = 0;

// 传感器数据
Sensor_Fusion sensor_fusion = {0};
uint8_t sensor_ready = 0;
uint8_t calibration_complete = 0;

// 定时器
uint32_t last_sensor_update = 0;
uint32_t last_can_send = 0;
volatile uint32_t last_heartbeat = 0;
volatile uint32_t last_status_update = 0;
uint32_t last_diagnostic = 0;
uint32_t last_calibration_check = 0;

// CAN接收数据
SystemCtrl_Data system_ctrl = {0};
volatile uint8_t heartbeat_status[NODE_NUM] = {0};
volatile uint32_t heartbeat_time[NODE_NUM] = {0};

/** 函  数：系统初始化
  * 参  数：无
  * 返回值：无
  */
void System_Init(void)
{
	/* 1. 全局 NVIC 优先级分组（仅此一次） */
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    
    /* 2. 基础设施 */
    Timer_Init();
    Serial_Init(DEBUG_BAUDRATE);
    
    printf("\r\n\r\n");
    printf("================================\r\n");
    printf("  ECU3 - Sensor Fusion Unit\r\n");
    printf("  Version: 1.0.0\r\n");
    printf("  Build Date: %s %s\r\n", __DATE__, __TIME__);
    printf("================================\r\n\r\n");
    
    // 初始化LED
    LED_Init();
    
    // 系统启动指示
    printf("System initializing...\r\n");
    
    LED1_ON();
    Delay_ms(200);
    LED2_ON();
    Delay_ms(200);
    LED3_ON();
    Delay_ms(200);
    
    LED1_OFF();
    LED2_OFF();
    LED3_OFF();
    
    // 初始化CAN
    MyCAN_Init(CAN_BAUDRATE);
    
    // 初始化传感器
    printf("Initializing sensors...\r\n");
    
    // 1. 初始化MPU6050
    if(MPU6050_Init())
	{
        printf("MPU6050 initialized successfully\r\n");
        LED1_ON();
    }
	else
	{
        printf("MPU6050 initialization failed\r\n");
        error_code |= ERROR_MPU6050_FAIL;
		system_state = SYS_ERROR;
		return;
    }
    
    // 2. 初始化超声波
    Ultrasonic_Init();
    printf("Ultrasonic initialized\r\n");
    LED2_ON();
    
    // 3. 初始化电压检测
    Voltage_Init();
    printf("Voltage detection initialized\r\n");
    LED3_ON();
    
    // 等待传感器稳定
    Delay_ms(1000);
    
    LED1_OFF();
    LED2_OFF();
    LED3_OFF();
    
    // 传感器自检
    printf("Running sensor self-tests...\r\n");
    Sensor_Self_Test();
    
    // 初始化传感器融合
    Sensor_Fusion_Init();
    
    // 启动系统
    system_state = SYS_READY;
    system_uptime = 0;
    sensor_ready = 1;
	
	IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);
    IWDG_SetPrescaler(IWDG_Prescaler_64);
    IWDG_SetReload(0x0FFF);  /* ~6.55s */
    IWDG_ReloadCounter();
    IWDG_Enable();
    
    printf("System initialized successfully!\r\n");
    
	heartbeat_time[NODE_ID - 1] = HAL_GetTick();
	
    // 启动成功指示
    for(int i = 0; i < 3; i++)
	{
        LED1_ON();
		LED2_ON();
		LED3_ON();
        Delay_ms(100);
        LED1_OFF();
		LED2_OFF();
		LED3_OFF();
        Delay_ms(100);
    }
}

/** 函  数：传感器自检
  * 参  数：无
  * 返回值：无
  */
void Sensor_Self_Test(void)
{
    printf("=== Sensor Self Test ===\r\n");
    
    // MPU6050自检
    printf("MPU6050 self test: ");
    if(MPU6050_Self_Test())
	{
        printf("PASS\r\n");
    }
	else
	{
        printf("FAIL\r\n");
        error_code |= ERROR_MPU6050_FAIL;
    }
    
    // 超声波自检
    printf("Ultrasonic test: ");
    Ultrasonic_Trigger();
    uint32_t t0 = HAL_GetTick();
	while (HAL_GetTick() - t0 < 200U)
	{  /* 最多等 200ms */
		Ultrasonic_Update();
		if (ultrasonic_data.valid) break;
	}
    if(ultrasonic_data.valid)
	{
        printf("PASS (Distance: %dmm)\r\n", ultrasonic_data.distance_mm);
    }
	else
	{
        printf("FAIL\r\n");
        error_code |= ERROR_ULTRASONIC_FAIL;
    }
    
    // 电压检测自检
    printf("Voltage detection test: ");
    Voltage_Update();
    Voltage_Data volt = Voltage_GetData();
    if(volt.voltage_v > 5.0f && volt.voltage_v < 15.0f)
	{
        printf("PASS (Voltage: %.2fV)\r\n", volt.voltage_v);
    }
	else
	{
        printf("FAIL (Voltage: %.2fV)\r\n", volt.voltage_v);
        error_code |= ERROR_VOLTAGE_LOW;
    }
    
    printf("=======================\r\n");
}

/**
 * 函  数：所有传感器非阻塞式更新
 * 参  数：无
 * 返回值：无
 * 说  明：每个主循环都调用，负责触发/检查各传感器数据采集
 *         - MPU6050：I2C 读取姿态数据（当前阻塞 ~5ms，未来可改 DMA）
 *         - 超声波：触发+回波检测（内部含 150ms 节流，非阻塞）
 *         - 电压  ：ADC 单次转换（~0.3ms，可接受）
 */
void Sensor_Update_All(void)
{
    /* 1. 更新 MPU6050（当前阻塞式读取约 5ms，可改为 DMA+中断） */
    MPU6050_Read_RawData();
 
    /* 2. 更新超声波（内部含节流，触发后立即返回，非阻塞） */
    Ultrasonic_Update();
 
    /* 3. 更新电压（ADC 单次转换约 0.3ms，可接受） */
    Voltage_Update();
}

/** 函  数：传感器融合初始化
  * 参  数：无
  * 返回值：无
  */
void Sensor_Fusion_Init(void)
{
    // 初始化传感器融合数据结构
    sensor_fusion.distance_mm = 0;
    sensor_fusion.distance_cm = 0.0f;
    sensor_fusion.roll = 0.0f;
    sensor_fusion.pitch = 0.0f;
    sensor_fusion.yaw = 0.0f;
    sensor_fusion.voltage_v = 0.0f;
    sensor_fusion.temperature_c = 0.0f;
    sensor_fusion.valid = 0;
    sensor_fusion.timestamp = 0;
    
    printf("Sensor fusion initialized\r\n");
}

/** 函  数：传感器融合处理
  * 参  数：无
  * 返回值：无
  */
void Sensor_Fusion_Process(void)
{
    static uint32_t last_fusion_time = 0;
    uint32_t current_time = HAL_GetTick();
	
	uint32_t elapsed = current_time - last_fusion_time;  // 模运算自动处理溢出
    if (elapsed < 20)
	{  // 至少 20ms
        return;
    }
	
    float dt = (float)elapsed / 1000.0f;  // 转换为秒
    // 限制最大 dt，防止长时间阻塞导致积分爆炸
    if (dt > 0.1f)
	{  // 最大 100ms
        dt = 0.1f;
        // 可选：记录异常，用于诊断
        // printf("Warning: sensor fusion dt clamped to %.3f\r\n", dt);
    }
	
    // 姿态解算
    MPU6050_Calculate_Attitude(dt);
	
