THow-M/STM32_CAN_DVCS_Project/Firmware/ECU3_Sensor_Unit/User/main.c
    // 1. 更新MPU6050姿态
    MPU6050_Data mpu = MPU6050_GetData();
    
    // 2. 更新超声波
    //Ultrasonic_Update();
    
    // 3. 更新电压
    Voltage_Data volt = Voltage_GetData();
    
    // 4. 融合数据
    sensor_fusion.distance_mm = ultrasonic_data.distance_mm;
    sensor_fusion.distance_cm = ultrasonic_data.distance_cm;
    sensor_fusion.roll = mpu.roll;
    sensor_fusion.pitch = mpu.pitch;
    sensor_fusion.yaw = mpu.yaw;
    sensor_fusion.voltage_v = volt.filtered_v;
    sensor_fusion.temperature_c = mpu.temperature_c;
    //sensor_fusion.valid = ultrasonic_data.valid;
	/* --- 修复：valid = 所有子系统都有效 --- */
	MPU6050_Data mpu_check = MPU6050_GetData();
	Voltage_Data volt_check = Voltage_GetData();
	uint8_t mpu_valid = (mpu_check.accel_x != 0 || mpu_check.accel_y != 0 || mpu_check.accel_z != 0) ? 1 : 0;
	uint8_t volt_valid = (volt_check.status != VOLTAGE_LOW) ? 1 : 0;
	sensor_fusion.valid = ultrasonic_data.valid & mpu_valid & volt_valid;
    sensor_fusion.timestamp = current_time;
    
    // 5. 异常检测
    Sensor_Anomaly_Detection();
    
    // 6. 数据滤波
    Sensor_Data_Filtering();
    
    last_fusion_time = current_time;
}

/** 函  数：传感器异常检测
  * 参  数：无
  * 返回值：无
  */
void Sensor_Anomaly_Detection(void)
{
    // 检查超声波数据
    static uint8_t anomaly_close_count = 0;   /* 近距离计数 */
	static uint8_t anomaly_far_count = 0;     /* 远距离计数 */
	uint8_t anomaly_detected = 0;
	
	if(ultrasonic_data.distance_mm < 20)
	{
		anomaly_far_count = 0;                /* 近距离：清零远距离计数 */
		if(++anomaly_close_count > 5)
		{
			printf("Warning: Object too close! (%dmm)\r\n", ultrasonic_data.distance_mm);
			anomaly_detected = 1;
		}
	}
	else if(ultrasonic_data.distance_mm > 4000)
	{
		anomaly_close_count = 0;              /* 远距离：清零近距离计数 */
		if(++anomaly_far_count > 5)
		{
			printf("Warning: Ultrasonic reading out of range! (%dmm)\r\n", ultrasonic_data.distance_mm);
			anomaly_detected = 1;
		}
	}
	else
	{
		anomaly_close_count = 0;
		anomaly_far_count = 0;
	}
    
    // 检查姿态角度
	static uint32_t last_anomaly_print = 0;
	static uint32_t current_time = 0;
    if(fabs(sensor_fusion.roll) > 45.0f || fabs(sensor_fusion.pitch) > 45.0f)
	{
		current_time = HAL_GetTick();
		if (current_time - last_anomaly_print > 1000U)
		{
			last_anomaly_print = current_time;
			printf("Warning: Excessive tilt! Roll=%.1f, Pitch=%.1f\r\n", 
               sensor_fusion.roll, sensor_fusion.pitch);
		}
        
        anomaly_detected = 1;
    }
    
    // 检查电压
    if(sensor_fusion.voltage_v < VOLTAGE_MIN)
	{
        printf("Warning: Low voltage! %.2fV\r\n", sensor_fusion.voltage_v);
        anomaly_detected = 1;
    }
	else if(sensor_fusion.voltage_v > VOLTAGE_MAX)
	{
        printf("Warning: High voltage! %.2fV\r\n", sensor_fusion.voltage_v);
        anomaly_detected = 1;
    }
    
    if(anomaly_detected)
	{
        LED3_ON();  // 报警指示
    }
	else
	{
        LED3_OFF();
    }
}

/** 函  数：数据滤波
  * 参  数：无
  * 返回值：无
  */
void Sensor_Data_Filtering(void)
{
	static uint8_t filter_initialized = 0;
    static float filtered_distance = 0;
    static float filtered_roll = 0;
    static float filtered_pitch = 0;
    static float filtered_yaw = 0;
    
    if(filter_initialized == 0)
	{
        filtered_distance = sensor_fusion.distance_cm;
        filtered_roll = sensor_fusion.roll;
        filtered_pitch = sensor_fusion.pitch;
        filtered_yaw = sensor_fusion.yaw;
		filter_initialized = 1;
    }
	else
	{
        // 低通滤波
        float alpha = 0.7f;  // 滤波系数
        
        filtered_distance = alpha * filtered_distance + (1 - alpha) * sensor_fusion.distance_cm;
        filtered_roll = alpha * filtered_roll + (1 - alpha) * sensor_fusion.roll;
        filtered_pitch = alpha * filtered_pitch + (1 - alpha) * sensor_fusion.pitch;
        filtered_yaw = alpha * filtered_yaw + (1 - alpha) * sensor_fusion.yaw;
        
        sensor_fusion.filtered_distance_cm = filtered_distance;
        sensor_fusion.filtered_roll = filtered_roll;
        sensor_fusion.filtered_pitch = filtered_pitch;
        sensor_fusion.filtered_yaw = filtered_yaw;
    }
}

/** 函  数：自动校准
  * 参  数：无
  * 返回值：无
  */
void Auto_Calibration(void)
{
    static uint32_t calibration_start = 0;
    static uint8_t calibration_phase = 0;
    
    if(!calibration_complete)
	{
        if(calibration_start == 0)
		{
            calibration_start = HAL_GetTick();
            printf("Starting auto-calibration...\r\n");
            calibration_phase = 1;
        }
        
        uint32_t current_time = HAL_GetTick();
        
        switch(calibration_phase)
		{
            case 1:  // MPU6050校准
                if(current_time - calibration_start < 2000)
				{  // 2秒
                    LED1_ON();
                    MPU6050_Calibrate();
                }
				else
				{
                    LED1_OFF();
                    calibration_start = current_time;
                    calibration_phase = 2;
                    printf("MPU6050 calibration complete\r\n");
                }
                break;
                
            case 2:  // 超声波校准
                if(current_time - calibration_start < 3000)
				{  // 3秒
                    LED2_ON();
                    Ultrasonic_Calibrate();
                }
				else
				{
                    LED2_OFF();
                    calibration_start = current_time;
                    calibration_phase = 3;
                    printf("Ultrasonic calibration complete\r\n");
                }
                break;
                
            case 3:  // 电压校准
                if(current_time - calibration_start < 3000)
				{  // 3秒
                    LED3_ON();
                    // 假设标准电压为12.0V
                    Voltage_Calibrate(12.0f);
                }
				else
				{
                    LED3_OFF();
                    calibration_complete = 1;
                    printf("Auto-calibration completed\r\n");
                    
