THow-M/STM32_CAN_DVCS_Project/Firmware/ECU3_Sensor_Unit/User/main.c
                    // 完成指示
                    for(int i = 0; i < 5; i++)
					{
                        LED1_ON();
						LED2_ON();
						LED3_ON();
                        Delay_ms(100);
                        LED1_OFF();
						LED2_OFF();
						LED3_OFF();
                        Delay_ms(100);
                    }
                }
                break;
        }
    }
}

/** 函  数：主控制循环
  * 参  数：无
  * 返回值：无
  */
void Control_Loop(void)
{
    uint32_t current_time = HAL_GetTick();
    
	//传感器数据采集更新
	if(system_state == SYS_RUN || system_state == SYS_READY)
    {
        Sensor_Update_All();
    }
	
    // 传感器融合处理
    if(system_state == SYS_RUN || system_state == SYS_READY)
	{
        Sensor_Fusion_Process();
        
        // 调试输出
        static uint32_t last_debug_time = 0;
        if(current_time - last_debug_time > 1000)
		{  // 每秒输出一次
            last_debug_time = current_time;
            
            if(sensor_fusion.valid)
			{
                printf("Sensor: Dist=%dmm, Roll=%.1f, Pitch=%.1f, Volt=%.2fV, Temp=%.1fC\r\n",
                       sensor_fusion.distance_mm,
                       sensor_fusion.roll,
                       sensor_fusion.pitch,
                       sensor_fusion.voltage_v,
                       sensor_fusion.temperature_c);
            }
        }
    }
    
    // 系统状态监测
    static uint32_t last_status_check = 0;
    if(current_time - last_status_check > 500)
	{  // 每500ms检查一次
        last_status_check = current_time;
        
        // 检查传感器状态
        if(!ultrasonic_data.valid && system_uptime > 5)
		{
            error_code |= ERROR_ULTRASONIC_FAIL;
            printf("Ultrasonic sensor failure detected\r\n");
        }
        
        if(sensor_fusion.voltage_v < 9.0f)
		{
            error_code |= ERROR_VOLTAGE_LOW;
            printf("Warning: Very low voltage! %.2fV\r\n", sensor_fusion.voltage_v);
        }
    }
}

/** 函  数：通信处理
  * 参  数：无
  * 返回值：无
  */
void Communication_Handler(void)
{
    uint32_t current_time = HAL_GetTick();
    
    // 1. CAN数据处理
    uint32_t can_id;
    uint8_t can_data[8];
    uint8_t can_len;
    
    while(MyCAN_Receive_Message(&can_id, &can_len, can_data))
	{
        CAN_Data_Handler(can_id, can_len, can_data);
    }
    
    // 2. 发送心跳包
    if(current_time - last_heartbeat > HEARTBEAT_PERIOD)
	{
        last_heartbeat = current_time;
        
        uint8_t status = (system_state == SYS_ERROR) ? STATUS_ERROR : STATUS_NORMAL;
        MyCAN_Send_Heartbeat(NODE_ID, status, error_code, system_uptime);
        
		heartbeat_time[NODE_ID - 1] = current_time;
		
        // LED指示
        static uint8_t heartbeat_led = 0;
        heartbeat_led = !heartbeat_led;
		if(heartbeat_led)
		{
			LED1_ON();
		}
		else
		{
			LED1_OFF();
		}
    }
    
    // 3. 发送传感器数据
    if(current_time - last_can_send > 100)
	{  // 100ms发送一次
        last_can_send = current_time;
        
        if(can_connected && sensor_fusion.valid)
		{
            // 发送传感器数据
            MyCAN_Send_SensorData(sensor_fusion.distance_mm,
                                (int16_t)(sensor_fusion.pitch * 10),  // 0.1度精度
                                (int16_t)(sensor_fusion.roll * 10),
                                (int16_t)(sensor_fusion.yaw * 10));  // mV
	
			(void)MyCAN_Send_SensorVoltage(
				(uint16_t)(sensor_fusion.voltage_v * 1000.0f));
            
            // LED指示
            LED2_ON();
        }
    }
	else if(current_time - last_can_send > 10)
	{
        LED2_OFF();
    }
    
    // 4. 检查CAN连接状态
    static uint32_t last_can_msg_time = 0;
    static uint8_t can_msg_received = 0;
    
    for(uint8_t i = 0; i < NODE_NUM; i++)
	{
        if(i == NODE_ID - 1) continue;  // 跳过自己
        
        if(current_time - heartbeat_time[i] < HEARTBEAT_TIMEOUT)
		{
            can_msg_received = 1;
            last_can_msg_time = current_time;
        }
    }
    
    if(can_msg_received && current_time - last_can_msg_time < CAN_TIMEOUT)
	{
        can_connected = 1;
        LED3_ON();  // CAN连接指示
    }
	else
	{
        can_connected = 0;
        LED3_OFF();
        
        if(system_uptime > 5)
		{  // 系统启动5秒后
            printf("CAN disconnected\r\n");
        }
    }
}

/** 函  数：CAN数据处理
  * 参  数：id CAN报文ID
  * 参  数：len 接收数据长度
  * 参  数：data 接受的数据
  * 返回值：无
  */
void CAN_Data_Handler(uint32_t id, uint8_t len, uint8_t* data)
{
    switch(id)
	{
        case MSG_ID_HEARTBEAT:
		{
			if (len < sizeof(HeartBeat_Data)) break;
            HeartBeat_Data *hb = (HeartBeat_Data*)data;
            if(hb->node_id >= 1 && hb->node_id <= NODE_NUM)
			{
                heartbeat_time[hb->node_id - 1] = HAL_GetTick();
                
                if(hb->node_id == NODE_ID_ECU1)
				{  // 来自ECU1
                    can_connected = 1;
                }
            }
            break;
        }
            
        case MSG_ID_SYSTEM_CTRL:
		{
            if(len >= sizeof(SystemCtrl_Data))
			{
                memcpy(&system_ctrl, data, sizeof(SystemCtrl_Data));
                
                printf("Received SystemCtrl: Command=%d\r\n", system_ctrl.command);
                
                switch(system_ctrl.command)
				{
                    case SYS_CMD_START:
                        system_state = SYS_RUN;
                        printf("System started\r\n");
                        break;
                        
                    case SYS_CMD_STOP:
                        system_state = SYS_IDLE;
                        printf("System stopped\r\n");
                        break;
                        
                    case SYS_CMD_RESET:
                        NVIC_SystemReset();
                        break;
                        
                    case SYS_CMD_CALIBRATE:
                        printf("Calibration requested\r\n");
                        calibration_complete = 0;
                        system_state = SYS_CALIBRATING;
                        break;
                        
                    case SYS_CMD_DIAGNOSTIC:
                        diagnostic_requested = 1;
                        break;
                        
                    case SYS_CMD_SELF_TEST:
                        Sensor_Self_Test();
                        break;
					default:
						printf("Unknown command: %d\r\n", system_ctrl.command);
						break;
                }
            }
            break;
        }
            
        default:
            // 其他报文
            break;
    }
}

/** 函  数：系统诊断
  * 参  数：无
  * 返回值：无
  */
void System_Diagnostic(void)
{
    printf("\r\n=== System Diagnostic ===\r\n");
    printf("System State: %d\r\n", system_state);
    printf("Uptime: %lu seconds\r\n", system_uptime);
    printf("Error Code: 0x%02X\r\n", error_code);
    printf("CAN Connected: %s\r\n", can_connected ? "Yes" : "No");
    printf("Sensor Ready: %s\r\n", sensor_ready ? "Yes" : "No");
    printf("Calibration Complete: %s\r\n", calibration_complete ? "Yes" : "No");
    printf("\r\n");
    
    // 传感器数据
    printf("Sensor Data:\r\n");
    printf("Distance: %dmm (%.1fcm)\r\n", 
           sensor_fusion.distance_mm, sensor_fusion.distance_cm);
    printf("Roll: %.1f deg\r\n", sensor_fusion.roll);
    printf("Pitch: %.1f deg\r\n", sensor_fusion.pitch);
    printf("Yaw: %.1f deg\r\n", sensor_fusion.yaw);
    printf("Voltage: %.2fV\r\n", sensor_fusion.voltage_v);
    printf("Temperature: %.1fC\r\n", sensor_fusion.temperature_c);
    printf("Valid: %s\r\n", sensor_fusion.valid ? "Yes" : "No");
    printf("\r\n");
    
