THow-M/STM32_CAN_DVCS_Project/Firmware/ECU3_Sensor_Unit/User/main.c
    // 原始传感器数据
    MPU6050_Data mpu = MPU6050_GetData();
    printf("MPU6050 Raw:\r\n");
    printf("Accel: X=%d, Y=%d, Z=%d\r\n", mpu.accel_x, mpu.accel_y, mpu.accel_z);
    printf("Gyro: X=%d, Y=%d, Z=%d\r\n", mpu.gyro_x, mpu.gyro_y, mpu.gyro_z);
    printf("Temp: %.1fC\r\n", mpu.temperature_c);
    printf("\r\n");
    
    // 超声波数据
    printf("Ultrasonic:\r\n");
    printf("Distance: %dmm\r\n", ultrasonic_data.distance_mm);
    printf("Valid: %s\r\n", ultrasonic_data.valid ? "Yes" : "No");
    printf("Signal Strength: %d%%\r\n", ultrasonic_data.signal_strength);
    printf("\r\n");
    
    // 电压数据
    Voltage_Data volt = Voltage_GetData();
    printf("Voltage:\r\n");
    printf("Voltage: %.2fV (%dmV)\r\n", volt.voltage_v, volt.voltage_mv);
    printf("Battery: %d%%\r\n", volt.battery_percent);
    printf("Status: %d\r\n", volt.status);
    printf("\r\n");
    
    // 心跳状态
    printf("Heartbeat Status:\r\n");
    for(uint8_t i = 0; i < NODE_NUM; i++)
	{
        uint32_t time_since = HAL_GetTick() - heartbeat_time[i];
        printf("Node %d: %s (%.1fs ago)\r\n", 
               i + 1, 
               time_since < HEARTBEAT_TIMEOUT ? "Online" : "Offline",
               time_since / 1000.0f);
    }
    
    printf("===========================\r\n\r\n");
}



int main(void) 
{
    System_Init();
	
	printf("ECU3 Main Loop Started\r\n");
	
    while(1) 
	{
        uint32_t current_time = HAL_GetTick();
        
        // 更新运行时间
        if(current_time - last_status_update >= 1000)
		{  // 1秒
            last_status_update = current_time;
            system_uptime++;
            
            // 每5秒输出一次状态
            if(system_uptime % 5 == 0)
			{
                printf("Uptime: %lus, State: %d, CAN: %s\r\n",
                       (unsigned long)system_uptime, system_state, can_connected ? "Connected" : "Disconnected");
            }
        }
        
        // 控制循环
        Control_Loop();
        
        // 通信处理
        Communication_Handler();
        
		//打印诊断
		if (diagnostic_requested)
		{
			diagnostic_requested = 0;
			System_Diagnostic();
		}
		
        // 系统状态机
        switch(system_state)
		{
            case SYS_IDLE:
                // 空闲状态
				LED1_OFF();
				LED2_OFF();
				LED3_OFF();
                break;
                
            case SYS_READY:
                // 准备就绪，LED慢闪
                if((current_time / 500) % 2 == 0)
				{
                    LED1_ON();
					LED2_ON();
					LED3_ON();
                }
				else
				{
                    LED1_OFF();
					LED2_OFF();
					LED3_OFF();
                }
                break;
                
            case SYS_RUN:
                // 运行状态，LED常亮
                LED1_ON();
				LED2_ON();
				LED3_ON();
                break;
                
            case SYS_ERROR:
                // 错误状态
                Error_Handler();
                break;
                
            case SYS_CALIBRATING:
                // 校准状态
                Auto_Calibration();
                if(calibration_complete)
				{
                    system_state = SYS_READY;
                }
                break;
        }
        
        // 简单延时
        Delay_ms(1);
		
		/* 喂狗 */
		IWDG_ReloadCounter();
    }
}



/** 函  数：错误处理
  * 参  数：无
  * 返回值：无
  */
void Error_Handler(void)
{
    static uint32_t error_start_time = 0;
    uint32_t current_time = HAL_GetTick();
    
    if(error_start_time == 0)
	{
        error_start_time = current_time;
        printf("Entering error state. Code: 0x%02X\r\n", error_code);
    }
    
    // LED快速闪烁表示错误
    static uint32_t last_blink = 0;
    if(current_time - last_blink > 100)
	{
        last_blink = current_time;
        static uint8_t led_state = 0;
        led_state = !led_state;
        
        if (led_state)
		{
			LED1_ON(); LED2_ON(); LED3_ON();
		}
		else
		{
			LED1_OFF(); LED2_OFF(); LED3_OFF();
		}
    }
    
    // 尝试自动恢复
    if(current_time - error_start_time > 5000)
	{  
		error_start_time = current_time;  /* 允许周期性重试 */
		// 5秒后尝试恢复
        printf("Attempting to recover from error...\r\n");
        
        // 尝试重新初始化传感器
        if(error_code & ERROR_MPU6050_FAIL)
		{
            printf("Reinitializing MPU6050...\r\n");
            if(MPU6050_Init())
			{
                error_code &= ~ERROR_MPU6050_FAIL;
            }
        }
        
        if(error_code & ERROR_ULTRASONIC_FAIL)
		{
            printf("Reinitializing Ultrasonic...\r\n");
            Ultrasonic_Init();
            error_code &= ~ERROR_ULTRASONIC_FAIL;
        }
        
        if(error_code & ERROR_VOLTAGE_LOW)
		{
            Voltage_Update();
			if (voltage_data.voltage_v >= VOLTAGE_MIN)
			{
				error_code &= ~ERROR_VOLTAGE_LOW;
				printf("Voltage recovered: %.2fV\r\n", voltage_data.voltage_v);
			}
        }
        
        // 如果所有错误都清除，恢复系统
        if(error_code == 0)
		{
            system_state = SYS_READY;
            error_start_time = 0;
            printf("Error recovery successful.\r\n");
        }
		else
		{
            printf("Some errors still present: 0x%02X\r\n", error_code);
        }
    }
}

void TIM2_IRQHandler(void)
{
	if (TIM_GetITStatus(TIM2, TIM_IT_Update) == SET)
	{
		Tick_ms++;
		
		
		
		TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
	}
}
